In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4, 7, -5, 3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj2 = pd.Series([4,7,-5,3], index=['a','b','c','d'])
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [5]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
obj2.dtype

dtype('int64')

In [8]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], 
              ['서울', '부산', '인천', '대구']
             )
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [9]:
s.name = "인구"
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
s/1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [12]:
s[1]

3448737

In [13]:
s["부산"]

3448737

In [14]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [15]:
s>=2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [16]:
s[s>=2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [17]:
s[s<= 5000000]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [18]:
# 2백5십만 이상 5백만 이하 도시 출력
s[(s>=2500000) & (s<=5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [19]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [20]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [21]:
data = {"서울":9631482, "부산":3393191, "인천":2632035,
       "대전":1490158}
data

{'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}

In [22]:
s2 = pd.Series(data)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [23]:
s-s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [24]:
ds = s-s2

In [25]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [26]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [27]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [28]:
rs = (s-s2)/s2*100

In [29]:
rs["부산"] = 1.6
rs["대구"] = 1.41
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.832690
인천    9.818107
dtype: float64

In [30]:
del rs["서울"]

In [31]:
rs

대구    1.410000
대전         NaN
부산    1.600000
인천    9.818107
dtype: float64

In [32]:
data = {
    "2015":[9904312, 3448737, 2890451, 2466052],
    "2010":[9631482, 3393191, 2632035, 2431774]
    }
data

{'2015': [9904312, 3448737, 2890451, 2466052],
 '2010': [9631482, 3393191, 2632035, 2431774]}

In [33]:
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [34]:
df.index = ["서울", "부산", "인천", "대구"]
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [35]:
df.T

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [36]:
human = {
    "키":[175.3, 180.2, 178.3],
    "몸무게":[66.2, 78.9, 55.1],
    "나이":[27, 49, 35]
    }
human = pd.DataFrame(human)
human.index = ["홍길동", "김사또", "임꺽정"]
human

         키   몸무게  나이
홍길동  175.3  66.2  27
김사또  180.2  78.9  49
임꺽정  178.3  55.1  35

In [37]:
human = human.T

In [38]:
human

       홍길동    김사또    임꺽정
키    175.3  180.2  178.3
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [39]:
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [40]:
df.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [41]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [42]:
df.columns

Index(['2015', '2010'], dtype='object')

In [43]:
df[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [44]:
df["2010"]

서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [45]:
df[["2015", "2010"]]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [46]:
df["2005"] = [9762546, 3512547, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [47]:
df[0:1]

       2015     2010     2005
서울  9904312  9631482  9762546

In [48]:
df["서울":"인천"]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [49]:
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [50]:
df.loc["서울", "2015"]

9904312

In [51]:
df.iloc[0:1, 0:1]

       2015
서울  9904312

In [52]:
data = pd.read_csv("data/population_number.csv", index_col="도시", encoding="euc-kr")

In [53]:
data

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [54]:
data.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [55]:
data["2010"].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [56]:
score = pd.read_csv("data/score.csv", index_col="과목", encoding="euc-kr")
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [57]:
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [58]:
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [59]:
score.T.sum()

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [60]:
score["합계"] = score.T.sum()

In [61]:
score

    1반  2반  3반  4반   합계
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [62]:
score["평균"] = score.iloc[:, :-1].T.sum()/4
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [63]:
score["평균2"] = score["합계"]/4
score

    1반  2반  3반  4반   합계     평균    평균2
과목
수학  45  44  73  39  201  50.25  50.25
영어  76  92  45  69  282  70.50  70.50
국어  47  92  45  69  253  63.25  63.25
사회  92  81  85  40  298  74.50  74.50
과학  11  79  47  26  163  40.75  40.75

In [64]:
score["평균3"] = score.loc[:, :"4반"].mean(axis=1)
score

    1반  2반  3반  4반   합계     평균    평균2    평균3
과목
수학  45  44  73  39  201  50.25  50.25  50.25
영어  76  92  45  69  282  70.50  70.50  70.50
국어  47  92  45  69  253  63.25  63.25  63.25
사회  92  81  85  40  298  74.50  74.50  74.50
과학  11  79  47  26  163  40.75  40.75  40.75

In [65]:
score.loc["반평균"] = [1, 2, 3, 4, 5, 6, 7, 8]

In [66]:
score

     1반  2반  3반  4반   합계     평균    평균2    평균3
과목
수학   45  44  73  39  201  50.25  50.25  50.25
영어   76  92  45  69  282  70.50  70.50  70.50
국어   47  92  45  69  253  63.25  63.25  63.25
사회   92  81  85  40  298  74.50  74.50  74.50
과학   11  79  47  26  163  40.75  40.75  40.75
반평균   1   2   3   4    5   6.00   7.00   8.00

In [67]:
score.loc["반평균"] = score.iloc[:-1, :].mean()
score

       1반    2반    3반    4반     합계     평균    평균2    평균3
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25  50.25  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50  70.50  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25  63.25  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50  74.50  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75  40.75  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85  59.85  59.85

In [68]:
score.max(axis=1)

과목
수학     201.0
영어     282.0
국어     253.0
사회     298.0
과학     163.0
반평균    239.4
dtype: float64

In [69]:
score.min(axis=1)

과목
수학     39.0
영어     45.0
국어     45.0
사회     40.0
과학     11.0
반평균    48.6
dtype: float64

In [73]:
score.T.max()

과목
수학     201.0
영어     282.0
국어     253.0
사회     298.0
과학     163.0
반평균    239.4
dtype: float64

In [80]:
score.iloc[:-1, :4].T.max()

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [81]:
score.iloc[:-1, :4].T.min()

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

In [83]:
bmi = pd.read_csv("data/bmi.csv", index_col="label")
bmi

        height  weight
label
normal     140      45
fat        145      72
fat        150      61
fat        137      56
thin       192      48
...        ...     ...
fat        157      67
normal     138      40
normal     163      62
normal     169      68
thin       183      39

[20000 rows x 2 columns]

In [85]:
bmi.loc["fat"].count()

height    7712
weight    7712
dtype: int64

In [86]:
bmi.loc["normal"].count()

height    5950
weight    5950
dtype: int64

In [87]:
bmi.loc["thin"].count()

height    6338
weight    6338
dtype: int64

In [94]:
bmi[bmi["height"] >= 170].loc["fat"].count()

height    222
weight    222
dtype: int64

In [101]:
bmi[bmi["height"] >= 170].loc["fat", "weight"].mean()

77.35585585585585